ab_test.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        162 bytes

Concurrency Level:      100
Time taken for tests:   0.213 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      321000 bytes
HTML transferred:       162000 bytes
Requests per second:    4689.82 [#/sec] (mean)
Time per request:       21.323 [ms] (mean)
Time per request:       0.213 [ms] (mean, across all concurrent requests)
Transfer rate:          1470.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9   3.1      9      18
Processing:     3   10   3.6     10      22
Waiting:        1    7   3.5      6      18
Total:         10   20   3.4     20      30

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     21
  75%     22
  80%     22
  90%     24
  95%     25
  98%     26
  99%     27
 100%     30 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /api/products
Document Length:        178 bytes

Concurrency Level:      100
Time taken for tests:   0.191 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      398000 bytes
HTML transferred:       178000 bytes
Requests per second:    5233.30 [#/sec] (mean)
Time per request:       19.108 [ms] (mean)
Time per request:       0.191 [ms] (mean, across all concurrent requests)
Transfer rate:          2034.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8   2.5      8      16
Processing:     1   10   3.2      9      22
Waiting:        0    6   3.2      5      20
Total:         11   18   2.9     17      31

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     18
  75%     19
  80%     20
  90%     21
  95%     22
  98%     29
  99%     29
 100%     31 (longest request)