ab_test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /api/products
Document Length:        35574 bytes

Concurrency Level:      100
Time taken for tests:   1.955 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      36498000 bytes
HTML transferred:       35574000 bytes
Requests per second:    511.41 [#/sec] (mean)
Time per request:       195.538 [ms] (mean)
Time per request:       1.955 [ms] (mean, across all concurrent requests)
Transfer rate:          18227.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.9      0       8
Processing:    14  177 139.3    123     704
Waiting:        8  173 131.0    122     703
Total:         22  178 140.5    123     710

Percentage of the requests served within a certain time (ms)
  50%    123
  66%    135
  75%    150
  80%    161
  90%    378
  95%    594
  98%    688
  99%    699
 100%    710 (longest request)